app/controllers/addresses_controller.rb

  def index
    @addresses = Address.all
---
SELECT "addresses".* FROM "addresses"

    def set_address
      @address = Address.find(params[:id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]