app/controllers/restaurants_controller.rb

  def index
    load_restaurants
    @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save
---
INSERT INTO "restaurants" ("name", "location", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["location", "Test"], ["created_at", "2018-03-19 11:25:24.107129"], ["updated_at", "2018-03-19 11:25:24.107129"], ["image", "flores-bonitas-girasoles.jpg"]]

    def set_restaurant
      @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]