app/controllers/searches_controller.rb

  def index
    @cities = search_city_Combobox
    @food = search_food_Combobox


    @allRestaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"